12duke/STM32_TDCR/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define JOY_KEY_Pin GPIO_PIN_7
#define JOY_KEY_GPIO_Port GPIOE
#define KEY3_Pin GPIO_PIN_8
#define KEY3_GPIO_Port GPIOE
#define KEY2_Pin GPIO_PIN_9
#define KEY2_GPIO_Port GPIOE
#define KEY1_Pin GPIO_PIN_10
#define KEY1_GPIO_Port GPIOE
#define KEY0_Pin GPIO_PIN_11
#define KEY0_GPIO_Port GPIOE
#define LED0_Pin GPIO_PIN_8
#define LED0_GPIO_Port GPIOD
#define LED1_Pin GPIO_PIN_9
#define LED1_GPIO_Port GPIOD
#define M4_DIR_OUT_Pin GPIO_PIN_0
#define M4_DIR_OUT_GPIO_Port GPIOD
#define M3_DIR_OUT_Pin GPIO_PIN_1
#define M3_DIR_OUT_GPIO_Port GPIOD
#define M2_DIR_OUT_Pin GPIO_PIN_2
#define M2_DIR_OUT_GPIO_Port GPIOD
#define M1_DIR_OUT_Pin GPIO_PIN_3
#define M1_DIR_OUT_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
